import java.util.Arrays;

/**
 * @author zhengxin
 * @date 2021/3/17
 */
public class IntRight {

    public static void main(String[] args) {
//        将每个整数循环向右移
        int[] b = solve(6, 2, new int[]{1, 2, 3, 4, 5, 6});
//        [6,1,2,3,4,5]
//        int[] b = solve(100, 99, new int[]{2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 1});
/*
        int[] b = solve(100, 213, new int[]{1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100});
*/
            System.out.print(Arrays.toString(b));
    }


    /**
     * 旋转数组 , 不使用额外的数组
     *
     * @param n int整型 数组长度
     * @param m int整型 右移距离
     * @param a int整型一维数组 给定数组
     * @return int整型一维数组
     */
    public static int[] solve(int n, int m, int[] a) {
        // 移动M 位 。 肯定是 index 是要移走的位置。
        int index = m % n;
        System.out.println(index +"," + a.length);
        if (0 == index) {
            return a;
        }
        int temp = 0;
        //最多循环M次
        for (int i = 0; i < m; i++) {
            // i是从0开始

            //这里只整理一个正确的数。
            int i1 = n - index;
            if(i1 > n){
                i1 = n - index;
            }
            temp = a[i1];
            a[i1] = a[i];
            a[i] = temp;

        }
        return a;
    }
}
